{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "input_dtype": "float32", "bias": true, "b_constraint": null, "batch_input_shape": [null, 66, 200, 3], "W_constraint": null, "b_regularizer": null, "nb_filter": 24, "subsample": [2, 2], "nb_col": 5, "border_mode": "valid", "name": "convolution2d_1", "W_regularizer": null, "init": "normal", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "nb_row": 5, "nb_filter": 36, "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "border_mode": "valid", "name": "convolution2d_2", "W_regularizer": null, "init": "normal", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "nb_row": 5, "nb_filter": 48, "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "border_mode": "valid", "name": "convolution2d_3", "W_regularizer": null, "init": "normal", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "border_mode": "valid", "name": "convolution2d_4", "W_regularizer": null, "init": "normal", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "border_mode": "valid", "name": "convolution2d_5", "W_regularizer": null, "init": "normal", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "trainable": true, "input_dim": 1152, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "normal", "name": "dense_1", "output_dim": 1164, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "trainable": true, "input_dim": 1164, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "normal", "name": "dense_2", "output_dim": 100, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "trainable": true, "input_dim": 100, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "normal", "name": "dense_3", "output_dim": 50, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "trainable": true, "input_dim": 50, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "normal", "name": "dense_4", "output_dim": 1, "activity_regularizer": null}}]}